## Importing python libraries
### (Pandas, Numpy, Matplotlib, Seaborn & Plotly)

In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt 
import seaborn as sns 
import plotly as px

### Filtering by large categories

In [ ]:
df = pd.read_excel("titanic_save.xlsx")
df

In [ ]:
# df.age.value_counts()
# df.age.value_counts().nlargest(2)
# df.age.value_counts().nlargest(2).index

In [ ]:
counts = df.who.value_counts() # aggregate functions
counts.nlargest(1)

In [ ]:
df[df.who.isin(counts.nlargest(1).index)]

### Splitting a string into multiple columns

In [33]:
df_2 = pd.DataFrame({'Name':['Haseeb Raza','Ali Raza','Umar Ahmad'],
              'Qualification':['B.Sc','M.Phil','M.Phil']})
df_2

          Name Qualification
0  Haseeb Raza          B.Sc
1     Ali Raza        M.Phil
2   Umar Ahmad        M.Phil

In [31]:
df_2.Name.str.split(' ', expand=True)

        0      1
0  Haseeb   Raza
1     Ali   Raza
2    Umar  Ahmad

In [34]:
df_2[["first_name","last_name"]] = df_2.Name.str.split(' ', expand=True)
df_2

          Name Qualification first_name last_name
0  Haseeb Raza          B.Sc     Haseeb      Raza
1     Ali Raza        M.Phil        Ali      Raza
2   Umar Ahmad        M.Phil       Umar     Ahmad